In [32]:
import numpy as np
import pandas as pd

In [33]:
df = pd.read_excel('Book1.xlsx')
df

   Id    Name stream College
0   1    Amit    BCA   FGIPS
1   2  Anukul    BCA   FGIPS
2   3   Ankit  Btech   FGIET
3   4   Amita    BBA   FGIPS
4   5    John   Bcom      FG
5   6    Sara    MBA   FGIPS
6   7  Alisha  Btech   FGIET
7   8   Sumit    BSC      FG
8   9    Jack     BA      FG
9  10   Henry    BCA   FGIPS

In [34]:
dff = pd.read_excel('Book2.xlsx')
dff

   Id      Name stream College
0   1      Amit    BCA   FGIPS
1   2  Khadeeja    BSC     FG
2   3      Aman    BCA   FGIPS
3   4     Amita    BBA   FGIPS
4   5      John   Bcom      FG
5   6      Sara    MBA   FGIPS
6   7    Alisha  Btech   FGIET
7   8      Jack     BA      FG
8   9     Kohli     BA      FG
9  10     Henry    BCA   FGIPS

In [35]:
compare_val = df.values == dff.values
print(compare_val)

[[ True  True  True  True]
 [ True False False False]
 [ True False False False]
 [ True  True  True  True]
 [ True  True  True  True]
 [ True  True  True  True]
 [ True  True  True  True]
 [ True False False  True]
 [ True False  True  True]
 [ True  True  True  True]]

In [39]:
rows,cols = np.where(compare_val == False)
rows,cols

(array([1, 1, 1, 2, 2, 2, 7, 7, 8], dtype=int64),
 array([1, 2, 3, 1, 2, 3, 1, 2, 1], dtype=int64))

In [41]:
l = []
for item in zip(rows,cols):
   a =  df.iloc[item]
   b= item
   l.append(a)
pd.DataFrame(l)

        0
0  Anukul
1     BCA
2   FGIPS
3   Ankit
4   Btech
5   FGIET
6   Sumit
7     BSC
8    Jack

Below code will find the common data between both the excel file, and save it into a new file.

In [53]:
compare_value = pd.merge(df,dff,how='inner',on=['Id','Name','stream','College'])
print(compare_value)
#compare_value.to_excel("New_File.xlsx")

   Id    Name stream College
0   1    Amit    BCA   FGIPS
1   4   Amita    BBA   FGIPS
2   5    John   Bcom      FG
3   6    Sara    MBA   FGIPS
4   7  Alisha  Btech   FGIET
5  10   Henry    BCA   FGIPS

Below code will combine both the excel file into a single file. It works as set data structure it will save the record once(if a record is present in both file then it will read once in a new file).

In [66]:
compare_value = pd.merge(df,dff,how='outer',on=['Id','Name','stream','College'])
print(compare_value)
#compare_value.to_excel("New_File2.xlsx")

    Id      Name stream College
0    1      Amit    BCA   FGIPS
1    2    Anukul    BCA   FGIPS
2    3     Ankit  Btech   FGIET
3    4     Amita    BBA   FGIPS
4    5      John   Bcom      FG
5    6      Sara    MBA   FGIPS
6    7    Alisha  Btech   FGIET
7    8     Sumit    BSC      FG
8    9      Jack     BA      FG
9   10     Henry    BCA   FGIPS
10   2  Khadeeja    BSC     FG
11   3      Aman    BCA   FGIPS
12   8      Jack     BA      FG
13   9     Kohli     BA      FG

In [54]:
tf = pd.read_csv('batting.csv')
tff = pd.read_csv('bowling.csv')

In [61]:
compare_valuee = pd.merge(tf,tff,how='inner',on=['MatchID'])
print(compare_valuee)
#compare_valuee.to_excel('check.xlsx')

       MatchID  InningsNo_x Team_x      PlayerName_x  MatchPlayingOrder  \
0            1            1    CSK  Ruturaj  Gaikwad                  1
1            1            1    CSK  Ruturaj  Gaikwad                  1
2            1            1    CSK  Ruturaj  Gaikwad                  1
3            1            1    CSK  Ruturaj  Gaikwad                  1
4            1            1    CSK  Ruturaj  Gaikwad                  1
...        ...          ...    ...               ...                ...
18849       76            2     GT        Yash Dayal                 11
18850       76            2     GT        Yash Dayal                 11
18851       76            2     GT        Yash Dayal                 11
18852       76            2     GT        Yash Dayal                 11
18853       76            2     GT        Yash Dayal                 11

        BowlerName                      OutDesc  Runs_x  Balls  DotBalls_x  \
0      Umesh Yadav  c Nitish Rana b Umesh Yadav       0      4           4
1      Umesh Yadav  c Nitish Rana b Umesh Yadav       0      4           4
2      Umesh Yadav  c Nitish Rana b Umesh Yadav       0      4           4
3      Umesh Yadav  c Nitish Rana b Umesh Yadav       0      4           4
4      Umesh Yadav  c Nitish Rana b Umesh Yadav       0      4           4
...            ...                          ...     ...    ...         ...
18849          NaN                          NaN       0      0           0
18850          NaN                          NaN       0      0           0
18851          NaN                          NaN       0      0           0
18852          NaN                          NaN       0      0           0
18853          NaN                          NaN       0      0           0

       ...  Economy  BowlingOrder  TotalLegalBallsBowled  DotBalls_y  Ones_y  \
0      ...     5.00             1                     24          15       7
1      ...     8.75             2                     24          12       7
2      ...     5.75             3                     24          11      10
3      ...     3.75             4                     24          10      13
4      ...     9.50             5                     24           7      10
...    ...      ...           ...                    ...         ...     ...
18849  ...     3.50             1                     24          17       4
18850  ...    10.00             2                     24          13       2
18851  ...     5.00             3                     24          10      10
18852  ...     8.21             4                     19           5      10
18853  ...    10.67             5                     18           2      10

      Twos_y  Threes_y  Fours_y  Sixes_y  StrikeRate_y
0          0         0        1        1          12.0
1          1         0        3        2           0.0
2          1         0        1        1          24.0
3          1         0        0        0           0.0
4          1         0        5        1          24.0
...      ...       ...      ...      ...           ...
18849      2         0        1        0          24.0
18850      3         0        6        1          24.0
18851      3         0        1        0          24.0
18852      1         0        2        1           0.0
18853      3         0        1        2           0.0

[18854 rows x 38 columns]